Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.Start(Autodesk.Revit.DB.ElementId)
Starts the edit scope.
assetElementId:
The appearance asset element whose asset should be edited.
Returns:
The appearance asset to be used for editing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.1

Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.#ctor(Autodesk.Revit.DB.Document)
Constructs a new instance of an AppearanceAssetEditScope.
document:
The document for which this EditScope is going to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.1